docs/deploy/loadtest-ec2/reservation-distributed.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=282.44ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4315    119.500183/s
    checks_succeeded...: 100.00% 4315 out of 4315
    checks_failed......: 0.00%   0 out of 4315

    ✓ status is 201 or 409

    CUSTOM
    created_201....................: 1      0.027694/s

    HTTP
    http_req_duration..............: avg=139.03ms min=4.92ms med=110.79ms max=979.52ms p(90)=220.96ms p(95)=282.44ms
      { expected_response:true }...: avg=139.03ms min=4.92ms med=110.79ms max=979.52ms p(90)=220.96ms p(95)=282.44ms
    http_req_failed................: 0.00%  0 out of 4355
    http_reqs......................: 4355   120.607948/s

    EXECUTION
    iteration_duration.............: avg=139.2ms  min=5.1ms  med=110.84ms max=985.5ms  p(90)=221.43ms p(95)=282.74ms
    iterations.....................: 4315   119.500183/s
    vus............................: 20     min=0         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 2.2 MB 60 kB/s
    data_sent......................: 1.8 MB 49 kB/s