docs/deploy/loadtest-ec2/reservation-none.txt
Unable to find image 'grafana/k6:latest' locally
latest: Pulling from grafana/k6
4f4fb700ef54: Pulling fs layer
55afa1ecc21d: Pulling fs layer
e5b773ddb4d8: Pulling fs layer
275eb3e317af: Pulling fs layer
4f4fb700ef54: Already exists
55afa1ecc21d: Download complete
e5b773ddb4d8: Download complete
8d44e72234a0: Download complete
55afa1ecc21d: Pull complete
e5b773ddb4d8: Pull complete
275eb3e317af: Download complete
4f4fb700ef54: Pull complete
275eb3e317af: Pull complete
Digest: sha256:5221b620a4f874faff6e32ba597aa667c058391fe4898b1c6f6377f062c6cdec
Status: Downloaded newer image for grafana/k6:latest


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=192.88ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 7114    195.812645/s
    checks_succeeded...: 100.00% 7114 out of 7114
    checks_failed......: 0.00%   0 out of 7114

    ✓ status is 201 or 409

    CUSTOM
    created_201....................: 3      0.082575/s

    HTTP
    http_req_duration..............: avg=84.5ms  min=4.98ms med=68.62ms max=587.71ms p(90)=149.25ms p(95)=192.88ms
      { expected_response:true }...: avg=84.5ms  min=4.98ms med=68.62ms max=587.71ms p(90)=149.25ms p(95)=192.88ms
    http_req_failed................: 0.00%  0 out of 7154
    http_reqs......................: 7154   196.913644/s

    EXECUTION
    iteration_duration.............: avg=84.36ms min=5.13ms med=68.59ms max=500.36ms p(90)=148.95ms p(95)=192.62ms
    iterations.....................: 7114   195.812645/s
    vus............................: 20     min=0         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 3.6 MB 98 kB/s
    data_sent......................: 2.9 MB 79 kB/s