docs/deploy/loadtest-ec2/reservation-pessimistic.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=213.53ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6166    171.017983/s
    checks_succeeded...: 100.00% 6166 out of 6166
    checks_failed......: 0.00%   0 out of 6166

    ✓ status is 201 or 409

    CUSTOM
    created_201....................: 1      0.027736/s

    HTTP
    http_req_duration..............: avg=97.41ms min=9.07ms med=74.57ms max=934.24ms p(90)=158.76ms p(95)=213.53ms
      { expected_response:true }...: avg=97.41ms min=9.07ms med=74.57ms max=934.24ms p(90)=158.76ms p(95)=213.53ms
    http_req_failed................: 0.00%  0 out of 6206
    http_reqs......................: 6206   172.127409/s

    EXECUTION
    iteration_duration.............: avg=97.37ms min=9.25ms med=74.66ms max=934.67ms p(90)=158.63ms p(95)=213.64ms
    iterations.....................: 6166   171.017983/s
    vus............................: 20     min=0         max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 3.1 MB 86 kB/s
    data_sent......................: 2.5 MB 69 kB/s