docs/deploy/loadtest-ec2/room-read-redis.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<300' p(95)=102.31ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 20948   693.454629/s
    checks_succeeded...: 100.00% 20948 out of 20948
    checks_failed......: 0.00%   0 out of 20948

    ✓ rooms 200
    ✓ schedule 200

    HTTP
    http_req_duration..............: avg=42.83ms min=1.55ms med=33.91ms max=1.19s p(90)=73.12ms p(95)=102.31ms
      { expected_response:true }...: avg=42.83ms min=1.55ms med=33.91ms max=1.19s p(90)=73.12ms p(95)=102.31ms
    http_req_failed................: 0.00%  0 out of 20949
    http_reqs......................: 20949  693.487732/s

    EXECUTION
    iteration_duration.............: avg=85.95ms min=3.73ms med=69.57ms max=1.43s p(90)=138.6ms p(95)=190.4ms 
    iterations.....................: 10474  346.727314/s
    vus............................: 30     min=30         max=30
    vus_max........................: 30     min=30         max=30

    NETWORK
    data_received..................: 13 MB  434 kB/s
    data_sent......................: 1.9 MB 64 kB/s